{
  "0": {
    "name": "MiG Killer (30 x 38)",
    "description": "In honor of Capt. Steve Ritchie. The only U.S. Air Force pilot ace of the Vietnam War, Capt. Ritchie destroyed five MiG-21s during Operation Linebacker in 1972. McDonnell Douglas F-4 Phantom; a tandem two-seat, twin-engine, all-weather, long-range supersonic jet interceptor fighter-bomber used by Marines, Navy and Air Force to destroy enemy ground targets once a LRRP team found em. First flight was in 1958.",
    "type": "Original Acrylic (30x53) Giclee (30 x 38)",
    "url": "/images/media/image1.jpeg",
    "price": "Price Not Available"
  },
  "1": {
    "name": "Thumper - First place - 2011 National VA Creative Arts Competition ",
    "description": "The sun was straight overhead as PFC David Kranig 2nd Battalion 327th Infantry leads his squad across a stream near Tuy Hoa.  PFC Kranig was wounded later that same week in the battle of Trung Luong.  Shot nine times with an AK-47 at close range.  Kranig lived and owns the original painting. A (Thumper) was the nick name for the M-79 grenade launcher.",
    "type": "Giclee (30 x 40)",
    "url": "/images/media/image2.jpeg",
    "price": "Price Not Available"
  },
  "2": {
    "name": "Helping Hand",
    "description": "His portrayal of a trooper helping a wounded enemy soldier to Medivac helicopter. Operation Nevada Eagle began on May 17, 1968 the Screaming Eagles of the 1st and 2nd Brigades had a new mission. The VC and NVA in the area badly needed the rice from the upcoming harvest. Working in coordination with the district chiefs, the brigades protected the villagers as they harvested their spring rice.  At 12:30 a.m. on May 21, 1968 an NVA battalion, augmented by personnel from a sapper demolition team, launched a daring ground attack against Camp Eagle, following a covering barrage of more than 400 rounds of 122mm rockets, 82mm mortars, B-40 and B-41 rocket-grenades into the Division headquarters area. The ground attack struck the southwest edge of the perimeter and was beaten back by headquarters troops of the 1st Brigade, members of the 2nd Bn., 502nd Abn Inf., and helicopter gunships.  At dawn a sweep of the area revealed 54 enemy bodies and 16 individual weapons captured",
    "type": "Original Acrylic (48x60) Giclee (30 x 38)",
    "url": "/images/media/image3.jpeg",
    "price": "Price Not Available"
  },
  "3": {
    "name": "LRRP Brothers",
    "description": "LRRP is short for long range reconnaissance patrol. Small teams of soldiers that took on the toughest assignments gathering intelligence in enemy territory while evading capture. LRRPs were a bread apart possessing team work, courage and the ability to move undetected through Vietnam’s jungles. They were revered by their soldiers and feared by their enemies.",
    "type": "Giclee (30x44)",
    "url": "/images/media/image4.jpeg",
    "price": "Price Not Available"
  },
  "4": {
    "name": "Looking up!",
    "description": "A soldier reaches for the heaven above.  A gesture to God?  A 101st Airborne paratrooper is reaching for a jungle penetrator being lowers from a UH-1D Medavac helicopter hovering overhead.   A Medevac helicopter was called a Dustoff.  The penetrator is metal device with foldout seats, it’s name comes from its function; to penetrate the thick jungle.   The prongs of the penetrator folded downs a seat for the individual being picked up. During these precarious pickups both the Dustoff crew and anyone riding the penetrator were wide open for enemy attack.",
    "type": "Original Acrylic 2 panels (30x48 - 36x48) Giclee (30 x 38)",
    "url": "/images/media/image5.jpeg",
    "price": "Price Not Available"
  },
  "5": {
    "name": "LRP Team-2 VC Pig On A Pole",
    "description": "LRP Team-2 Ambushed the NVA in the Ruong Ruong Valley Jan 1969.  The local VC carried food (the pig on the pole) and supplies (those round baskets on ground are for fishing in streams) to a hidden NVA basecamp located in the surrounding jungle mountain.   LRRPs (pronounced Lurp) stands for Long Range Reconnaissance Patrol became the 75th Ranger Jan 1969. The U.S. Army wanted its elite reconnaissance commandos united into a common regiment of uncommon skill became the 75th Rangers.  Merrill’s Marauders, the legendary rangers of Burma-India fame in World War II was reactivated as the 75th Inf. Regt. Twelve of the 14 long-range patrol units are to be known as Rangers.",
    "type": "Original Acrylic (36x48) Giclee (30x42)",
    "url": "/images/media/image6.jpeg",
    "price": "Price Not Available"
  },
  "6": {
    "name": "Fortune Favors the Bold",
    "description": "Huey’s flying in formation at pre-dawn.  Each chopper holds men from the 17th Cav 101st, a reaction force about to conduct an early morning CA (combat assault).   Six helicopters sweeps into view, above a mountainous Southeast Asian jungle. Misty draws, forested mountains disappear into thick low clouds, and sheer outcroppings of limestone give the breathless landscape the appearance of an oriental painting.   The chopper come beating in, head-on, and with its approach the roar of the turbines and the clatter of the rotors grow.  The sound becomes almost unbearably loud.",
    "type": "Original Acrylic (30x48) Giclee (30x38)",
    "url": "/images/media/image7.jpeg",
    "price": "Price Not Available"
  },
  "7": {
    "name": "Liberation of Hue",
    "description": "Marines are pinned down by a VC sniper in battle for Hue 1968. A Medic gives first aid to a wounded Marine. February 4, 1968, five days after the NVA and VC had overrun Hue, the old Imperial capital of Vietnam, at the beginning of their Tet Offensive. The First Marine Division was sent to take back the city and they did.",
    "type": "Original Acrylic (30x48) Giclee (30x40)",
    "url": "/images/media/image8.jpeg",
    "price": "Price Not Available"
  },
  "8": {
    "name": "In Coming!",
    "description": "Face down in the sand bagged bunker during a VC rocket attack Spc-4 Raymond Jackson’s waits to hear if he’s next.  If you could hear the rockets then you’re ok.  A nightly ritual on remote fires, like firebase Ripcord located in northern end of the A-Shau Valley when a local Viet Cong would fire two or three 122 rockets off into a US base camp then run and hide. Mao’s Communist China supplied 122 mm rockets used by the Viet Cong and NVA (North Vietnamese Army) to launch into a base camp.",
    "type": "No Acrylic Giclee (30 x 38)",
    "url": "/images/media/image9.jpeg",
    "price": "Price Not Available"
  },
  "9": {
    "name": "On point",
    "description": "(Honest) John Burford takes pointman position as he disappears into a wall of vegetation, leaving no sign that anyone had been there. With his face blackened by camouflage stick, clad in tiger fatigues wearing an US army issued “rucksacks,” the “behind the lines” troopers were capable of moving fast and avoiding detection.  Each man of the five men on SSgt Burford’s team carries a compass, signal mirror and items that may be needed in the event the team is broken up. Before the mission began, extensive preparations were made. The best route out of the area of operation for escape and evasion was explained to each member of the team. Hand signals were the primary means of communication among the team members.  Absolute silence - mandatory.",
    "type": "Original Acrylic (38X72) Giclee (30x38)",
    "url": "/images/media/image10.jpeg",
    "price": "Price Not Available"
  },
  "10": {
    "name": "Overflight",
    "description": "Before each recon mission team leaders when on over- flight of their AO (area of operation) they would look for trails, insertion and extraction LZs (landing zones). Relentless thick fog frequently made fighter bombers useless in the A Shau, and the enemy had furnished the nearby mountaintops with antiaircraft machine guns to protect the massive trail network that snaked through it.",
    "type": "Giclee (30x38)",
    "url": "/images/media/image11.jpeg",
    "price": "Price Not Available"
  },
  "11": {
    "name": "Brothers in Battle",
    "description": "First place - 2012 East Los Angles VA Creative Arts. Everyone bleeds the same color.   A medic in the 101st Airborne gives a wounded fellow trooper a drink of water while he waits until a Medivac helicopter can get him to a field hospital.",
    "type": "Original Acrylic (48x48) Giclee (36 x 36)",
    "url": "/images/media/image12.jpeg",
    "price": "Price Not Available"
  },
  "12": {
    "name": "False Insertion",
    "description": "The Ho Chi Minh trail crossed the western edge of our AO. The Laotian border cut across the back side of it. We had a one-in-four shot of this turning out well, which left three other possibilities: walk smack into the 5th NVA Regiment, fall off a cliff in the dark, or get ambushed and E&E off into the jungle until our rations ran out. Our chopper swung around and headed west contour flying nap-of-the-earth over mountaintops and down the spines of the never ending ridgelines.  Far below, jungle birds had swirled above a high speed trail that to triple canopy jungle stretched along the valley floor.  Below a valley that looked like a world lost in time, as if we should expect to see dinosaurs feeding on the jungle vines.  Then, we headed toward the range of hills commanding the west side of the valley.  We dropped, flared over a brushy clearing on the crest of a secondary ridge above the valley floor. False insertion!  We lifted up again, only to drop down the reverse slope of the ridge.  I starred at grass-covered clearing at the base of Dong Ap Bia and my heart started to pound.  My stomach clenched.",
    "type": "Type Not Available",
    "url": "/images/media/image13.jpeg",
    "price": "Price Not Available"
  },
  "13": {
    "name": "Heavy Load (Trooper in Desert Strom)",
    "description": "The next time you start to complain because you carry to much responsibility. A trooper takes a rest as he moves forward.   When a young man joins the army, puts on a uniform he is no longer an individual. He has given up his personal life and accepting a socially determined manner of life in the service of the society of which he is a member. Soldiers are acting not as individuals, they act as agents of something above them and to which they have given themselves.",
    "type": "No Acrylic Giclee (30x38)",
    "url": "/images/media/image14.png",
    "price": "Price Not Available"
  },
  "14": {
    "name": "Soul Brothers - The Battle of Nui Ke",
    "description": "The All Americans of the 82nd Airborne Division’s 3rd Brigade, under the operational control of the 101st, withdrew from their static security role to overrun the 5th NVA Regimental Headquarters nestled in the jungle-sheathed mountains 15 miles southwest of Hue. Tight security ringed the planning stages of the operation. Artillery preparations were halted one week prior to the operation. Aerial reconnaissance missions over the area were also curtailed during the days preceding the assault. To further tighten the secrecy, the command post CP was not to be moved to firebase Brick until the day of the operation. The 1st Bn., 508th Abn. Inf., were air-assaulted to the pre-planned landing zones.  The first heavy contact came on the second day of the operation when a platoon from Co. B overran a deserted enemy base camp. So surprised were the former occupants that they left their noon meal simmering in cooking pots. The platoon leader sent a recon squad downstream from his position to investigate a possible enemy hiding spot. The squad immediately came under intense fire from a concentration of enemy automatic weapons. The remainder of the platoon maneuvered to develop the contact. The platoon leader gave the order to fix bayonets and charged the enemy’s position. The element of surprise belonged to the Airborne as they overran the hostile position, killing 13 NVA regulars. As the paratroopers continued their pursuit, they came under heavy automatic weapons, B-40, and RPG-7 rocket fire.  The American’s pulled back and built a makeshift camp to allow air strikes to soften the area.",
    "type": "No Acrylic Giclee",
    "url": "/images/media/image15.jpeg",
    "price": "Price Not Available"
  },
  "15": {
    "name": "Eyes Behind The Lines",
    "description": "First place - 2012 East Los Angles VA Creative Arts  Artist’s self-portrait after six month of living in jungles of Vietnam you start to take on the appearance of other jungle predators.    Each Division had a LRRP (Long-Range Reconnaissance Patrol company) pronounced 'lurps' as the eyes and ears of Division.   The U.S. Marines called their LRRPs ‘Force Recon’.  All Army LRRP units became 75th Ranger companies January 1969.  Their mission was to penetrate the jungles far from regular American units, watch and gather intelligence on the enemy including size, strength, movement and location.  LRRP teams were made up of four to six men. In addition to surveillance they ambushed enemy units when an opportunity presented itself, but normally they were outnumbered 10 to one.   The LRRPs didn't get any publicity back home, but within the ranks of the Army, they were considered the most fearsome fighters of the war.  In the aftermath of Vietnam, independent Ranger companies morphed into the three 75th Ranger battalions.",
    "type": "Original Acrylic (30x48) Giclee (30x40)",
    "url": "/images/media/image16.jpeg",
    "price": "Price Not Available"
  },
  "16": {
    "name": "Getting-Over",
    "description": "There is always that one guy in every unit who doesn’t let circumstances compromise his creature comfort.  But in the middle of nowhere (the A Shau Valley) where–in-the-hell did this guy get an umbrella? Just prior to 1968 TET Offensive, the units of the 101st Abn 2nd Brigade deployed north to I Corps to join the 1st Air Cavalry Division in Operation Jeb Stuart. Initially landing and setting up at the Phu Bai airfield, the 2nd Brigade troopers started search operations immediately and soon moved north to LZ Sally. At the outbreak of the TET Offensive, 2nd Brigade troopers under the operational control of the 1st Cay, shared the fighting in the battle of Quang Tri and Hue. During the following weeks the score of enemy killed and captured as 2nd Brigade troopers cleaned out resistance in numerous villages between Hue and Quang Tri.",
    "type": "Original Acrylic (30x48) Giclee (30x40)",
    "url": "/images/media/image17.jpeg",
    "price": "Price Not Available"
  },
  "17": {
    "name": "Black Ops",
    "description": "Each Division had a LRRP (Long-Range Reconnaissance Patrol company) pronounced 'lurps' as the eyes and ears of Division.   The U.S. Marines called their LRRPs ‘Force Recon’.  All Army LRRP units became 75th Ranger companies January 1969.  Their mission was to penetrate the jungles far from regular American units, watch and gather intelligence on the enemy including size, strength, movement and location.  LRRP teams were made up of four to six men. In addition to surveillance they ambushed enemy units when an opportunity presented itself, but normally they were outnumbered 10 to one.   The LRRPs didn't get any publicity back home, but within the ranks of the Army, they were considered the most fearsome fighters of the war.  In the aftermath of Vietnam, independent Ranger companies morphed into the three 75th Ranger battalions.",
    "type": "Original Acrylic two panels (30x48) Giclee (30x40)",
    "url": "/images/media/image18.jpeg",
    "price": "Price Not Available"
  },
  "18": {
    "name": "Ron’s Last Mission",
    "description": "Acrylic (two panels 30x48) NEW",
    "type": "Type Not Available",
    "url": "/images/media/image19.jpeg",
    "price": "Price Not Available"
  },
  "19": {
    "name": "The Fall of Saigon",
    "description": "NVA on tank (48x60) NEW NVA Rolling Into Saigon April 1975. Acrylic (48x60) Giclee (30 x 38)",
    "type": "Type Not Available",
    "url": "/images/media/image20.jpeg",
    "price": "Price Not Available"
  },
  "20": {
    "name": "Ranger Team-6  24x36 Giclee",
    "description": "Someone once asked me what combat in Vietnam was like: First fill a backpack full of rocks until it weighs around 70 pounds. Grab a rifle, and a deep sea driver’s weight belt.  Wait until the rainiest day of the year then grab all your equipment then hick several miles up hill on the muddiest road you can find.  Fall flat on your face every few minutes.  Do the same maneuver every day.",
    "type": "Type Not Available",
    "url": "/images/media/image21.jpeg",
    "price": "Price Not Available"
  },
  "21": {
    "name": "River Crossing",
    "description": "At night, stop, dig a hole, fill the hole with water until it’s around your ankles so there is no danger of dozing off.  While you wait for it to get dark grab a jar full of biting insects and let them loose on your neck, face and the backs of your hands.  As the hole fills with water release a dozen or so water leeches and watch at how quickly they crawl inside your pants and under your arms.  Then ask someone to wake you every two hours and hand you a watch.  Stay wake for one hour then try and go back to sleep. Now continue this routine for the next 340 days.",
    "type": "Type Not Available",
    "url": "/images/media/image22.jpeg",
    "price": "Price Not Available"
  },
  "22": {
    "name": "Blue Saigon",
    "description": "",
    "type": "Type Not Available",
    "url": "/images/media/image23.jpeg",
    "price": "Price Not Available"
  },
  "23": {
    "name": "Rice Girl",
    "description": "",
    "type": "Type Not Available",
    "url": "/images/media/image24.jpeg",
    "price": "$500"
  },
  "24": {
    "name": "ấm áp bài hát ; Warm Song",
    "description": "",
    "type": "Type Not Available",
    "url": "/images/media/image25.jpeg",
    "price": "Price Not Available"
  },
  "25": {
    "name": "Hanoi City Girl In Green",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image26.jpeg",
    "price": "$90"
  },
  "26": {
    "name": "Cheekiness Hanoi",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image27.jpeg",
    "price": "$90"
  },
  "27": {
    "name": "Dinner With Sopaep",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image29.jpeg",
    "price": "$90"
  },
  "28": {
    "name": "The Heart of Cambodia",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image30.jpeg",
    "price": "$90"
  },
  "29": {
    "name": "Windy Day / Ho Chi Minh City",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image31.jpeg",
    "price": "$90"
  },
  "30": {
    "name": "Cambodia Sisters",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image32.jpeg",
    "price": "$90"
  },
  "31": {
    "name": "Monk Phnom Penh",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image33.jpeg",
    "price": "$90"
  },
  "32": {
    "name": "Monk Angkor Wat",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image34.jpeg",
    "price": "$90"
  },
  "33": {
    "name": "Baby Snow Leopard & Snow Leopard mama",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image35.jpeg",
    "price": "$90, $140"
  },
  "34": {
    "name": "Montagnard Mama with Baby",
    "description": "",
    "type": "Acrylic 24x36",
    "url": "/images/media/image36.jpeg",
    "price": "$50"
  }
}
