{
  "0": {
    "name": "MiG Killer (30 x 38)",
    "description": "In honor of Capt. Steve Ritchie. The only U.S. Air Force pilot ace of the Vietnam War, Capt. Ritchie destroyed five MiG-21s during Operation Linebacker in 1972. McDonnell Douglas F-4 Phantom; a tandem two-seat, twin-engine, all-weather, long-range supersonic jet interceptor fighter-bomber used by Marines, Navy and Air Force to destroy enemy ground targets once a LRRP team found em. First flight was in 1958.",
    "type": "Original Acrylic (30x53) Giclee (30 x 38)",
    "url": "/images/media/image1.jpeg",
    "price": "$000"
  },
  "1": {
    "name": "Thumper - First place - 2011 National VA Creative Arts Competition ",
    "description": "The sun was straight overhead as PFC David Kranig 2nd Battalion 327th Infantry leads his squad across a stream near Tuy Hoa.  PFC Kranig was wounded later that same week in the battle of Trung Luong.  Shot nine times with an AK-47 at close range.  Kranig lived and owns the original painting. A (Thumper) was the nick name for the M-79 grenade launcher.",
    "type": "Giclee (30 x 40)",
    "url": "/images/media/image2.jpeg",
    "price": "$000"
  },
  "2": {
    "name": "Helping Hand",
    "description": "His portrayal of a trooper helping a wounded enemy soldier to Medivac helicopter. Operation Nevada Eagle began on May 17, 1968 the Screaming Eagles of the 1st and 2nd Brigades had a new mission. The VC and NVA in the area badly needed the rice from the upcoming harvest. Working in coordination with the district chiefs, the brigades protected the villagers as they harvested their spring rice.  At 12:30 a.m. on May 21, 1968 an NVA battalion, augmented by personnel from a sapper demolition team, launched a daring ground attack against Camp Eagle, following a covering barrage of more than 400 rounds of 122mm rockets, 82mm mortars, B-40 and B-41 rocket-grenades into the Division headquarters area. The ground attack struck the southwest edge of the perimeter and was beaten back by headquarters troops of the 1st Brigade, members of the 2nd Bn., 502nd Abn Inf., and helicopter gunships.  At dawn a sweep of the area revealed 54 enemy bodies and 16 individual weapons captured",
    "type": "Original Acrylic (48x60) Giclee (30 x 38)",
    "url": "/images/media/image3.jpeg",
    "price": "$000"
  },
  "3": {
    "name": "LRRP Brothers",
    "description": "LRRP is short for long range reconnaissance patrol. Small teams of soldiers that took on the toughest assignments gathering intelligence in enemy territory while evading capture. LRRPs were a bread apart possessing team work, courage and the ability to move undetected through Vietnam’s jungles. They were revered by their soldiers and feared by their enemies.",
    "type": "Giclee (30x44)",
    "url": "/images/media/image4.jpeg",
    "price": "$000"
  },
  "4": {
    "name": "Looking up!",
    "description": "A soldier reaches for the heaven above.  A gesture to God?  A 101st Airborne paratrooper is reaching for a jungle penetrator being lowers from a UH-1D Medavac helicopter hovering overhead.   A Medevac helicopter was called a Dustoff.  The penetrator is metal device with foldout seats, it’s name comes from its function; to penetrate the thick jungle.   The prongs of the penetrator folded downs a seat for the individual being picked up. During these precarious pickups both the Dustoff crew and anyone riding the penetrator were wide open for enemy attack.",
    "type": "Original Acrylic 2 panels (30x48 - 36x48) Giclee (30 x 38)",
    "url": "/images/media/image5.jpeg",
    "price": "$000"
  },
  "5": {
    "name": "LRP Team-2 VC Pig On A Pole",
    "description": "LRP Team-2 Ambushed the NVA in the Ruong Ruong Valley Jan 1969.  The local VC carried food (the pig on the pole) and supplies (those round baskets on ground are for fishing in streams) to a hidden NVA basecamp located in the surrounding jungle mountain.   LRRPs (pronounced Lurp) stands for Long Range Reconnaissance Patrol became the 75th Ranger Jan 1969. The U.S. Army wanted its elite reconnaissance commandos united into a common regiment of uncommon skill became the 75th Rangers.  Merrill’s Marauders, the legendary rangers of Burma-India fame in World War II was reactivated as the 75th Inf. Regt. Twelve of the 14 long-range patrol units are to be known as Rangers.",
    "type": "Original Acrylic (36x48) Giclee (30x42)",
    "url": "/images/media/image6.jpeg",
    "price": "$000"
  },
  "6": {
    "name": "Fortune Favors the Bold",
    "description": "Huey’s flying in formation at pre-dawn.  Each chopper holds men from the 17th Cav 101st, a reaction force about to conduct an early morning CA (combat assault).   Six helicopters sweeps into view, above a mountainous Southeast Asian jungle. Misty draws, forested mountains disappear into thick low clouds, and sheer outcroppings of limestone give the breathless landscape the appearance of an oriental painting.   The chopper come beating in, head-on, and with its approach the roar of the turbines and the clatter of the rotors grow.  The sound becomes almost unbearably loud.",
    "type": "Original Acrylic (30x48) Giclee (30x38)",
    "url": "/images/media/image7.jpeg",
    "price": "$000"
  },
  "7": {
    "name": "Liberation of Hue",
    "description": "Marines are pinned down by a VC sniper in battle for Hue 1968. A Medic gives first aid to a wounded Marine. February 4, 1968, five days after the NVA and VC had overrun Hue, the old Imperial capital of Vietnam, at the beginning of their Tet Offensive. The First Marine Division was sent to take back the city and they did.",
    "type": "Original Acrylic (30x48) Giclee (30x40)",
    "url": "/images/media/image8.jpeg",
    "price": "$000"
  },
  "8": {
    "name": "In Coming!",
    "description": "Face down in the sand bagged bunker during a VC rocket attack Spc-4 Raymond Jackson’s waits to hear if he’s next.  If you could hear the rockets then you’re ok.  A nightly ritual on remote fires, like firebase Ripcord located in northern end of the A-Shau Valley when a local Viet Cong would fire two or three 122 rockets off into a US base camp then run and hide. Mao’s Communist China supplied 122 mm rockets used by the Viet Cong and NVA (North Vietnamese Army) to launch into a base camp.",
    "type": "No Acrylic Giclee (30 x 38)",
    "url": "/images/media/image9.jpeg",
    "price": "$000"
  },
  "9": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image10.jpeg",
    "price": "$000"
  },
  "10": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image11.jpeg",
    "price": "$000"
  },
  "11": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image12.jpeg",
    "price": "$000"
  },
  "12": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image13.jpeg",
    "price": "$000"
  },
  "13": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image14.png",
    "price": "$000"
  },
  "14": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image15.jpeg",
    "price": "$000"
  },
  "15": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image16.jpeg",
    "price": "$000"
  },
  "16": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image17.jpeg",
    "price": "$000"
  },
  "17": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image18.jpeg",
    "price": "$000"
  },
  "18": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image19.jpeg",
    "price": "$000"
  },
  "19": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image20.jpeg",
    "price": "$000"
  },
  "20": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image21.jpeg",
    "price": "$000"
  },
  "21": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image22.jpeg",
    "price": "$000"
  },
  "22": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image23.jpeg",
    "price": "$000"
  },
  "23": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image24.jpeg",
    "price": "$000"
  },
  "24": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image25.jpeg",
    "price": "$000"
  },
  "25": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image26.jpeg",
    "price": "$000"
  },
  "26": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image27.jpeg",
    "price": "$000"
  },
  "27": {
    "name": "",
    "description": "",
    "type": "",
    "url": "/images/media/image28.png",
    "price": "$000"
  }
}
